#### RebarPresentationMode Enumeration

---

|  |
| --- |
| See Also |

Bar presentation mode

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum RebarPresentationMode ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RebarPresentationMode ``` |

| Visual C++ |
| --- |
| ``` public enum class RebarPresentationMode ``` |

# Members

| Member name | Description |
| --- | --- |
| All | All bars are presented. |
| FirstLast | The first and last bars are presented. |
| Middle | The middle bar is presented. |
| Select | Selected bars are presented. |

# See Also

Autodesk.Revit.DB.Structure Namespace